website/app/controllers/users_controller.rb

INSERT INTO "users" ("first", "last", "email", "school_id", "created_at", "updated_at", "password_digest", "role") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @user = User.new(user_params)
    if @user.save

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "first" = ?, "last" = ?, "password_digest" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["first", "Admin!"], ["last", "Webmaster"], ["password_digest", "$2a$10$9mw7Bc86aYdgJcbHAinCT.4MYY7KFNNSkCmdT7x87xXCv1kINexEu"], ["updated_at", 2017-04-20 16:33:00 UTC], ["id", 1]]
---
  def update
    @user = User.find(params[:id])
    if @user.update_attributes(user_params)